SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_can.h
/*****************************************************************************
 * Copyright (c) 2019, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
*\*\file n32g430_can.h
*\*\author Nations
*\*\version v1.0.0
*\*\copyright Copyright (c) 2019, Nations Technologies Inc. All rights reserved.
**/
#ifndef __N32G430_CAN_H__
#define __N32G430_CAN_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32g430.h"


/** CAN init structure definition **/
typedef struct
{
    uint16_t BaudRatePrescaler; /* Specifies the length of a time quantum. */

    uint8_t OperatingMode; /* Specifies the CAN operating mode. */

    uint8_t RSJW; /* Specifies the maximum number of time quanta
                          the CAN hardware is allowed to lengthen or
                          shorten a bit to perform resynchronization. */

    uint8_t TBS1; /* Specifies the number of time quanta in Bit Segment 1. */

    uint8_t TBS2; /* Specifies the number of time quanta in Bit Segment 2. */

    FunctionalState TTCM; /* Enable or disable the time triggered communication mode. */

    FunctionalState ABOM; /* Enable or disable the automatic bus-off management. */

    FunctionalState AWKUM; /* Enable or disable the automatic wake-up mode. */

    FunctionalState NART; /* Enable or disable the no-automatic retransmission mode. */

    FunctionalState RFLM; /* Enable or disable the Receive DATFIFO Locked mode. */

    FunctionalState TXFP; /* Enable or disable the transmit DATFIFO priority. */
} CAN_InitType;

/** CAN filter init structure definition **/
typedef struct
{
    uint16_t Filter_HighId; /* Specifies the filter identification number (MSBs for a 32-bit
                                        configuration, first one for a 16-bit configuration). */

    uint16_t Filter_LowId; /* Specifies the filter identification number (LSBs for a 32-bit
                                       configuration, second one for a 16-bit configuration). */

    uint16_t FilterMask_HighId; /* Specifies the filter mask number or identification number,
                                            according to the mode (MSBs for a 32-bit configuration,
                                            first one for a 16-bit configuration). */

    uint16_t FilterMask_LowId; /* Specifies the filter mask number or identification number,
                                           according to the mode (LSBs for a 32-bit configuration,
                                           second one for a 16-bit configuration). */

    uint16_t Filter_FIFOAssignment; /* Specifies the DATFIFO (0 or 1) which will be assigned to the filter. */

    uint8_t Filter_Num; /* Specifies the filter which will be initialized. */

    uint8_t Filter_Mode; /* Specifies the filter mode to be initialized. */

    uint8_t Filter_Scale; /* Specifies the filter scale. */

    FunctionalState Filter_Act; /* Enable or disable the filter. */
} CAN_FilterInitType;

/** CAN Tx message structure definition **/
typedef struct
{
    uint32_t StdId; /* Specifies the standard identifier.
                         This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId; /* Specifies the extended identifier.
                         This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t IDE; /* Specifies the type of identifier for the message that
                      will be transmitted. This parameter can be a value
                      of @ref CAN_identifier_type */

    uint8_t RTR; /* Specifies the type of frame for the message that will
                      be transmitted. This parameter can be a value of
                      @ref CAN_remote_transmission_request */

    uint8_t DLC; /* Specifies the length of the frame that will be
                      transmitted. This parameter can be a value between
                      0 to 8 */

    uint8_t Data[8]; /* Contains the data to be transmitted. It ranges from 0
                          to 0xFF. */
} CanTxMessage;

/**  CAN Rx message structure definition **/
typedef struct
{
    uint32_t StdId; /* Specifies the standard identifier.
                         This parameter can be a value between 0 to 0x7FF. */

    uint32_t ExtId; /* Specifies the extended identifier.
                         This parameter can be a value between 0 to 0x1FFFFFFF. */

    uint8_t IDE; /* Specifies the type of identifier for the message that
                      will be received. */

    uint8_t RTR; /* Specifies the type of frame for the received message. */

    uint8_t DLC; /* Specifies the length of the frame that will be received.
                      This parameter can be a value between 0 to 8 */

    uint8_t Data[8]; /* Contains the data to be received. It ranges from 0 to
                          0xFF. */

