SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_can.h
    uint8_t FMI; /* Specifies the index of the filter the message stored in
                      the mailbox passes through. This parameter can be a
                      value between 0 to 0xFF */
} CanRxMessage;

typedef enum
{
    CAN_STS_Failed = 0,
    CAN_STS_Success
} CAN_Status;

typedef enum
{
    CAN_TXSTS_FAILED = 0,       /* CAN transmission failed */
    CAN_TXSTS_OK,               /* CAN transmission succeeded */
    CAN_TXSTS_PENDING           /* CAN transmission pending */
} CAN_Tx_Status;

/** CAN Master Control Register bits **/    
#define CAN_INIT_REQUEST     (CAN_MCTRL_INIRQ)     /* Initialization Request */
#define CAN_SLEEP_REQUEST    (CAN_MCTRL_SLPRQ)     /* Sleep Mode Request */
#define CAN_TX_FIFO_PRIO     (CAN_MCTRL_TXFP)      /* Transmit DATFIFO Priority */
#define CAN_RX_FIFO_LOCKED   (CAN_MCTRL_RFLM)      /* Receive DATFIFO Locked Mode */ 
#define CAN_AUTO_RETRANS_OFF (CAN_MCTRL_NART)      /* No Automatic Retransmission */ 
#define CAN_AUTO_WAKE_UP     (CAN_MCTRL_AWKUM)     /* Automatic Wakeup Mode */
#define CAN_AUTO_BUS_OFF     (CAN_MCTRL_ABOM)      /* Automatic Bus-Off Management */
#define CAN_TIME_TRI_MODE    (CAN_MCTRL_TTCM)      /* Time Triggered Communication Mode */
#define CAN_DEBUG_FREEZE     (CAN_MCTRL_DBGF)      /* Debug freeze */
#define CAN_SW_MASTER_RESET  (CAN_MCTRL_MRST)      /* software master reset */

/** CAN Master status Register bits **/
#define CAN_INIT_WAIT           (CAN_MSTS_INIAK)    /* Initialization Acknowledge */
#define CAN_SLEEP_WAIT          (CAN_MSTS_SLPAK)    /* Sleep Acknowledge */
#define CAN_ERROR_INT           (CAN_MSTS_ERRINT)   /* Error Interrupt */
#define CAN_WAKE_UP_INT         (CAN_MSTS_WKUINT)   /* Wakeup Interrupt */
#define CAN_SLEEP_WAITINT       (CAN_MSTS_SLAKINT)  /* Sleep Acknowledge Interrupt */
#define CAN_TX_MODE             (CAN_MSTS_TXMD)     /* Transmit Mode */
#define CAN_RX_MODE             (CAN_MSTS_RXMD)     /* Receive Mode */
#define CAN_LAST_SAMPLE_POINT   (CAN_MSTS_LSMP)     /* Last Sample Point */
#define CAN_RX_SIGNAL           (CAN_MSTS_RXS)      /* CAN Rx Signal */

/** CAN mailbox data length control and time stamp register bits **/
#define CAN_TX_GLOBAL_TIME0     CAN_TMDT0_TGT       /* Transmit Global Time */
#define CAN_TX_GLOBAL_TIME1     CAN_TMDT1_TGT       /* Transmit Global Time */
#define CAN_TX_GLOBAL_TIME2     CAN_TMDT2_TGT       /* Transmit Global Time */

/** CAN Mailbox Transmit Request **/
#define CAN_TMIX_TXRQ       (CAN_TMI0_TXRQ | CAN_TMI1_TXRQ) /* Transmit mailbox request */

/** CAN Filter Master Register bits **/
#define CAN_FILTER_INIT     (CAN_FMC_FINITM) /* Filter init mode */

/** Time out for INAK bit */
#define INIAK_TIMEOUT ((uint32_t)0x0000FFFF)
/** Time out for SLAK bit */
#define SLPAK_TIMEOUT ((uint32_t)0x0000FFFF)


/** Mailboxes definition **/
#define CAN_TXSTS_MAILBOX0  ((uint8_t)0x00) /* CAN transmit mailbox number 0 */
#define CAN_TXSTS_MAILBOX1  ((uint8_t)0x01) /* CAN transmit mailbox number 1 */
#define CAN_TXSTS_MAILBOX2  ((uint8_t)0x02) /* CAN transmit mailbox number 2 */
#define CAN_TXSTS_NOMAILBOX ((uint8_t)0x04) /* CAN cell did not provide an empty mailbox */

#define CAN_MODE_MASK       (CAN_MSTS_INIAK | CAN_MSTS_SLPAK)

/** OperatingMode **/
#define CAN_NORMAL_MODE          ((uint8_t)0x00) /* normal mode */
#define CAN_LOOPBACK_MODE        ((uint8_t)0x01) /* loopback mode */
#define CAN_SILENT_MODE          ((uint8_t)0x02) /* silent mode */
#define CAN_SILENT_LOOPBACK_MODE ((uint8_t)0x03) /* loopback combined with silent mode */

/** CAN_operating_mode **/
#define CAN_OPERATING_INITMODE      ((uint8_t)0x00) /* Initialization mode */
#define CAN_OPERATING_NORMALMODE    ((uint8_t)0x01) /* Normal mode */
#define CAN_OPERATING_SLEEPMODE     ((uint8_t)0x02) /* sleep mode */
#define CAN_OPERATING_MODE_OFFSET   (REG_BIT30_OFFSET)

/** CAN_synchronisation_jump_width **/
#define CAN_RSJW_1TQ        ((uint8_t)0x00) /* 1 time quantum */
#define CAN_RSJW_2TQ        ((uint8_t)0x01) /* 2 time quantum */
#define CAN_RSJW_3TQ        ((uint8_t)0x02) /* 3 time quantum */
#define CAN_RSJW_4TQ        ((uint8_t)0x03) /* 4 time quantum */
#define CAN_RSJW_OFFSET     (REG_BIT24_OFFSET)

/** CAN_time_quantum_in_bit_segment_1 **/
#define CAN_TBS1_1TQ  ((uint8_t)0x00) /* 1 time quantum */
#define CAN_TBS1_2TQ  ((uint8_t)0x01) /* 2 time quantum */
#define CAN_TBS1_3TQ  ((uint8_t)0x02) /* 3 time quantum */
#define CAN_TBS1_4TQ  ((uint8_t)0x03) /* 4 time quantum */
#define CAN_TBS1_5TQ  ((uint8_t)0x04) /* 5 time quantum */
#define CAN_TBS1_6TQ  ((uint8_t)0x05) /* 6 time quantum */
#define CAN_TBS1_7TQ  ((uint8_t)0x06) /* 7 time quantum */
#define CAN_TBS1_8TQ  ((uint8_t)0x07) /* 8 time quantum */
#define CAN_TBS1_9TQ  ((uint8_t)0x08) /* 9 time quantum */
#define CAN_TBS1_10TQ ((uint8_t)0x09) /* 10 time quantum */
#define CAN_TBS1_11TQ ((uint8_t)0x0A) /* 11 time quantum */
#define CAN_TBS1_12TQ ((uint8_t)0x0B) /* 12 time quantum */
#define CAN_TBS1_13TQ ((uint8_t)0x0C) /* 13 time quantum */
#define CAN_TBS1_14TQ ((uint8_t)0x0D) /* 14 time quantum */
#define CAN_TBS1_15TQ ((uint8_t)0x0E) /* 15 time quantum */
#define CAN_TBS1_16TQ ((uint8_t)0x0F) /* 16 time quantum */
#define CAN_TBS1_OFFSET     (REG_BIT16_OFFSET)

/** CAN_time_quantum_in_bit_segment_2 **/
#define CAN_TBS2_1TQ ((uint8_t)0x00) /* 1 time quantum */
#define CAN_TBS2_2TQ ((uint8_t)0x01) /* 2 time quantum */
#define CAN_TBS2_3TQ ((uint8_t)0x02) /* 3 time quantum */
#define CAN_TBS2_4TQ ((uint8_t)0x03) /* 4 time quantum */
#define CAN_TBS2_5TQ ((uint8_t)0x04) /* 5 time quantum */
#define CAN_TBS2_6TQ ((uint8_t)0x05) /* 6 time quantum */
#define CAN_TBS2_7TQ ((uint8_t)0x06) /* 7 time quantum */
#define CAN_TBS2_8TQ ((uint8_t)0x07) /* 8 time quantum */
#define CAN_TBS2_OFFSET     (REG_BIT20_OFFSET)

/** CAN_filter_mode **/
#define CAN_FILTER_IDMASKMODE ((uint8_t)0x00) /* identifier/mask mode */
#define CAN_FILTER_IDLISTMODE ((uint8_t)0x01) /* identifier list mode */

/** CAN_filter_scale **/
#define CAN_FILTER_16BITSCALE ((uint8_t)0x00) /* Two 16-bit filters */
#define CAN_FILTER_32BITSCALE ((uint8_t)0x01) /* One 32-bit filter */

/** CAN_filter_FIFO **/
#define CAN_FILTER_FIFO0            ((uint8_t)0x00) /* Filter DATFIFO 0 assignment for filter x */
#define CAN_FILTER_FIFO1            ((uint8_t)0x01) /* Filter DATFIFO 1 assignment for filter x */

