SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_can.h
/** CAN_identifier_type **/
#define CAN_STANDARD_ID         ((uint32_t)0x00000000) /* Standard Id */
#define CAN_EXTENDED_ID         ((uint32_t)0x00000004) /* Extended Id */
#define CAN_FRX_ID_OFFSET       (REG_BIT16_OFFSET)
#define CAN_TMI_STDID_OFFSET    (REG_BIT21_OFFSET)
#define CAN_TMI_EXTID_OFFSET    (REG_BIT3_OFFSET)

/** CAN_remote_transmission_request **/
#define CAN_RTRQ_DATA    ((uint32_t)0x00000000) /* Data frame */
#define CAN_RTRQ_REMOTE  ((uint32_t)0x00000002) /* Remote frame */

/** CAN_receive_FIFO_number_constants **/
#define CAN_FIFO0 ((uint8_t)0x00) /* CAN DATFIFO 0 used to receive */
#define CAN_FIFO1 ((uint8_t)0x01) /* CAN DATFIFO 1 used to receive */

/** CAN_Error_Code_constants **/
#define CAN_ERRORCODE_NOERR           ((uint8_t)0x00)                   /* No Error */
#define CAN_ERRORCODE_STUFFERR        (CAN_ESTS_LEC_0)                  /* Stuff Error */
#define CAN_ERRORCODE_FORMERR         (CAN_ESTS_LEC_1)                  /* Form Error */
#define CAN_ERRORCODE_ACKERR          (CAN_ESTS_LEC_0 | CAN_ESTS_LEC_1) /* Acknowledgment Error */
#define CAN_ERRORCODE_BITRECESSIVEERR (CAN_ESTS_LEC_2)                  /* Bit Recessive Error */
#define CAN_ERRORCODE_BITDOMINANTERR  (CAN_ESTS_LEC_0 | CAN_ESTS_LEC_2) /* Bit Dominant Error */
#define CAN_ERRORCODE_CRCERR          (CAN_ESTS_LEC_1 | CAN_ESTS_LEC_2) /* CRC Error  */
#define CAN_ERRORCODE_SWSETERR        (CAN_ESTS_LEC)                    /* Software Set Error */

#define CAN_TX_ERROR_COUNT            (CAN_ESTS_TXEC) /* Least significant byte of the 9-bit Transmit Error Counter */
#define CAN_RX_ERROR_COUNT            (CAN_ESTS_RXEC) /* Receive Error Counter */
#define CAN_ESTS_RX_ERROR_OFFSET      (REG_BIT24_OFFSET)
#define CAN_ESTS_TX_ERROR_OFFSET      (REG_BIT16_OFFSET)

#define CAN_ERROR_WARN_FLAG (CAN_ESTS_EWGFL) /* Error Warning Flag */
#define CAN_ERROR_PASS_FLAG (CAN_ESTS_EPVFL) /* Error Passive Flag */
#define CAN_BUS_OFF_FLAG    (CAN_ESTS_BOFFL) /* Bus-Off Flag */

/*** CAN_flags ***/
/** If the flag is 0x3XXXXXXX, it means that it can be used with CAN_GetFlagSTS()
   and CAN_ClearFlag() functions. **/
/** If the flag is 0x1XXXXXXX, it means that it can only be used with CAN_GetFlagSTS() function.  **/

#define CAN_FLAG_MASK   ((uint32_t)0x000FFFFF)

/** Transmit Flags **/
#define CAN_FLAG_RQCPM0 ((uint32_t)0x38000001) /* Request MailBox0 Flag */
#define CAN_FLAG_RQCPM1 ((uint32_t)0x38000100) /* Request MailBox1 Flag */
#define CAN_FLAG_RQCPM2 ((uint32_t)0x38010000) /* Request MailBox2 Flag */

/** Receive Flags **/
#define CAN_FLAG_FFMP0  ((uint32_t)0x12000003) /* DATFIFO 0 Message Pending Flag */
#define CAN_FLAG_FFULL0 ((uint32_t)0x32000008) /* DATFIFO 0 Full Flag            */
#define CAN_FLAG_FFOVR0 ((uint32_t)0x32000010) /* DATFIFO 0 Overrun Flag         */
#define CAN_FLAG_FFMP1  ((uint32_t)0x14000003) /* DATFIFO 1 Message Pending Flag */
#define CAN_FLAG_FFULL1 ((uint32_t)0x34000008) /* DATFIFO 1 Full Flag            */
#define CAN_FLAG_FFOVR1 ((uint32_t)0x34000010) /* DATFIFO 1 Overrun Flag         */

/** Operating Mode Flags **/
#define CAN_FLAG_WKU  ((uint32_t)0x31000008) /* Wake up Flag */
#define CAN_FLAG_SLAK ((uint32_t)0x31000012) /* Sleep acknowledge Flag */
/** Note: When SLAK intterupt is disabled (SLKIE=0), no polling on SLAKI is possible.
         In this case the SLAK bit can be polled. **/

/** Error Flags **/
#define CAN_FLAG_EWGFL ((uint32_t)0x10F00001) /* Error Warning Flag   */
#define CAN_FLAG_EPVFL ((uint32_t)0x10F00002) /* Error Passive Flag   */
#define CAN_FLAG_BOFFL ((uint32_t)0x10F00004) /* Bus-Off Flag         */
#define CAN_FLAG_LEC   ((uint32_t)0x30F00070) /* Last error code Flag */

/** Flags in TSTS register */
#define CAN_FLAGS_TSTS ((uint32_t)0x08000000)
/** Flags in RFF1 register */
#define CAN_FLAGS_RFF1 ((uint32_t)0x04000000)
/** Flags in RFF0 register */
#define CAN_FLAGS_RFF0 ((uint32_t)0x02000000)
/** Flags in MSTS register */
#define CAN_FLAGS_MSTS ((uint32_t)0x01000000)
/** Flags in ESTS register */
#define CAN_FLAGS_ESTS ((uint32_t)0x00F00000)

/** CAN_interrupts **/
#define CAN_INT_TME    (CAN_INTE_TMEITE) /* Transmit mailbox empty Interrupt*/

/** Flags named as Interrupts : kept only for FW compatibility **/
#define CAN_INT_RQCPM0 (CAN_INT_TME)
#define CAN_INT_RQCPM1 (CAN_INT_TME)
#define CAN_INT_RQCPM2 (CAN_INT_TME)

/** Receive Interrupts **/
#define CAN_INT_FMP0 (CAN_INTE_FMPITE0) /* DATFIFO 0 message pending Interrupt*/
#define CAN_INT_FF0  (CAN_INTE_FFITE0) /* DATFIFO 0 full Interrupt*/
#define CAN_INT_FOV0 (CAN_INTE_FOVITE0) /* DATFIFO 0 overrun Interrupt*/
#define CAN_INT_FMP1 (CAN_INTE_FMPITE1) /* DATFIFO 1 message pending Interrupt*/
#define CAN_INT_FF1  (CAN_INTE_FFITE1) /* DATFIFO 1 full Interrupt*/
#define CAN_INT_FOV1 (CAN_INTE_FOVITE1) /* DATFIFO 1 overrun Interrupt*/

/** Operating Mode Interrupts **/
#define CAN_INT_WKU (CAN_INTE_WKUITE) /* Wake-up Interrupt*/
#define CAN_INT_SLK (CAN_INTE_SLKITE) /* Sleep acknowledge Interrupt*/

/** Error Interrupts **/
#define CAN_INT_EWG (CAN_INTE_EWGITE) /* Error warning Interrupt*/
#define CAN_INT_EPV (CAN_INTE_EPVITE) /* Error passive Interrupt*/
#define CAN_INT_BOF (CAN_INTE_BOFITE) /* Bus-off Interrupt*/
#define CAN_INT_LEC (CAN_INTE_LECITE) /* Last error code Interrupt*/
#define CAN_INT_ERR (CAN_INTE_ERRITE) /* Error Interrupt*/

/** Bit definition for CAN_TMDTx register **/
#define CAN_TMDTx_DLC       (CAN_TMDT0_DLC | CAN_TMDT1_DLC) /* Data Length Code */
#define CAN_TMDTx_DLC_MASK  (~CAN_TMDTx_DLC)

/** Bit definition for CAN_TSTS register **/
#define CAN_TX_MAILBOX_EMPTY0 (CAN_TSTS_TMEM0) /* Transmit Mailbox 0 Empty */
#define CAN_TX_MAILBOX_EMPTY1 (CAN_TSTS_TMEM1) /* Transmit Mailbox 1 Empty */
#define CAN_TX_MAILBOX_EMPTY2 (CAN_TSTS_TMEM2) /* Transmit Mailbox 2 Empty */

#define CAN_TX_MAILBOX_CODE   (CAN_TSTS_CODE)    /* Mailbox Code */
#define CAN_TX_MAILBOX_0      (CAN_TSTS_CODE_0)  /* Mailbox 0 */
#define CAN_TX_MAILBOX_1      (CAN_TSTS_CODE_1)  /* Mailbox 1 */

#define CAN_MAILBOX0_RQ_OK (CAN_TSTS_RQCPM0) /* Request Completed Mailbox0 */
#define CAN_MAILBOX0_TX_OK (CAN_TSTS_TXOKM0) /* Transmission OK of Mailbox0 */
#define CAN_MAILBOX1_RQ_OK (CAN_TSTS_RQCPM1) /* Request Completed Mailbox1 */
#define CAN_MAILBOX1_TX_OK (CAN_TSTS_TXOKM1) /* Transmission OK of Mailbox1 */
#define CAN_MAILBOX2_RQ_OK (CAN_TSTS_RQCPM2) /* Request Completed Mailbox2 */
#define CAN_MAILBOX2_TX_OK (CAN_TSTS_TXOKM2) /* Transmission OK of Mailbox 2 */

#define CAN_MAILBOX0_RQ_AB (CAN_TSTS_ABRQM0) /* Abort Request for Mailbox0 */
#define CAN_MAILBOX1_RQ_AB (CAN_TSTS_ABRQM1) /* Abort Request for Mailbox1 */
#define CAN_MAILBOX2_RQ_AB (CAN_TSTS_ABRQM2) /* Abort Request for Mailbox2 */

