SoCXin/N32G430/src/firmware/n32g430_std_periph_driver/inc/n32g430_can.h
/** Bit definition for CAN_RMIx register **/
#define CAN_RMIx_RTRQ  (CAN_RMI0_RTRQ | CAN_RMI1_RTRQ) /* Remote Transmission Request */
#define CAN_RMIx_IDE   (CAN_RMI0_IDE | CAN_RMI1_IDE) /* Identifier Extension */
#define CAN_RMIx_EXTID (CAN_RMI0_EXTID | CAN_RMI1_EXTID) /* Extended Identifier */
#define CAN_RMIx_STDID (CAN_RMI0_STDID | CAN_RMI1_STDID) /* Standard Identifier or Extended Identifier */
#define CAN_EXTID_MASK (CAN_RMIx_EXTID | CAN_RMIx_STDID)
#define CAN_RMI_STDID_OFFSET    (REG_BIT21_OFFSET)
#define CAN_RMI_EXTID_OFFSET    (REG_BIT3_OFFSET)

/** CAN receive FIFO mailbox data register **/
#define CAN_RMDT_OFFSET             REG_BIT8_OFFSET
#define CAN_DATA_FIFO_MASK          ((CAN_RMDT0_FMI | CAN_RMDT1_FMI) >> CAN_RMDT_OFFSET)
#define CAN_RMDL_DATA1_OFFSET       REG_BIT8_OFFSET
#define CAN_RMDL_DATA2_OFFSET       REG_BIT16_OFFSET
#define CAN_RMDL_DATA3_OFFSET       REG_BIT24_OFFSET
#define CAN_RMDH_DATA5_OFFSET       REG_BIT8_OFFSET
#define CAN_RMDH_DATA6_OFFSET       REG_BIT16_OFFSET
#define CAN_RMDH_DATA7_OFFSET       REG_BIT24_OFFSET

/** Bit definition for CAN_RFFx register **/
#define CAN_FIFO0_PENDING           (CAN_RFF0_FFMP0) /* DATFIFO 0 Message Pending */
#define CAN_FIFO1_PENDING           (CAN_RFF1_FFMP1) /* DATFIFO 0 Message Pending */
#define CAN_FIFOX_PENDING_0         ((uint8_t)0x00)
#define CAN_FIFOX_PENDING_1         (CAN_RFF0_FFMP0_0)
#define CAN_FIFOX_PENDING_2         (CAN_RFF0_FFMP0_1)
#define CAN_FIFOX_PENDING_3         (CAN_RFF0_FFMP0)

#define CAN_RELEASE_FIFO_0 (CAN_RFF0_RFFOM0) /* Release DATFIFO 0 Output Mailbox */
#define CAN_RELEASE_FIFO_1 (CAN_RFF1_RFFOM1) /* Release DATFIFO 1 Output Mailbox */

#define CAN_FULL_FIFO_0 (CAN_RFF0_FFULL0) /* DATFIFO 0 Full */
#define CAN_OVER_FIFO_0 (CAN_RFF0_FFOVR0) /* DATFIFO 0 Overrun */
#define CAN_FULL_FIFO_1 (CAN_RFF1_FFULL1) /* DATFIFO 1 Full */
#define CAN_OVER_FIFO_1 (CAN_RFF1_FFOVR1) /* DATFIFO 1 Overrun */


/**  Function used to set the CAN configuration to the default reset state **/
void CAN_Reset(CAN_Module* CANx);

/** Initialization functions **/
void CAN_Sleep_Mode_Exit(CAN_Module* CANx);
void CAN_Initializes_Enable(CAN_Module* CANx);
void CAN_Initializes_Disable(CAN_Module* CANx);
void CAN_Initializes_Wait(CAN_Module* CANx);
void CAN_Initializes_Leave_Wait(CAN_Module* CANx);
void CAN_Time_Trigger_Mode_Enable(CAN_Module* CANx);
void CAN_Time_Trigger_Mode_Disable(CAN_Module* CANx);
void CAN_Bus_Off_Enable(CAN_Module* CANx);
void CAN_Bus_Off_Disable(CAN_Module* CANx);
void CAN_Wake_Up_Mode_Enable(CAN_Module* CANx);
void CAN_Wake_Up_Mode_Disable(CAN_Module* CANx);
void CAN_No_Retransmission_Enable(CAN_Module* CANx);
void CAN_No_Retransmission_Disable(CAN_Module* CANx);
void CAN_DATA_FIFO_Receive_Lock_Enable(CAN_Module* CANx);
void CAN_DATA_FIFO_Receive_Lock_Disable(CAN_Module* CANx);
void CAN_DATA_FIFO_Transmit_Priority_Enable(CAN_Module* CANx);
void CAN_DATA_FIFO_Transmit_Priority_Disable(CAN_Module* CANx);
void CAN_Bit_Timing_Set(CAN_Module* CANx, CAN_InitType* CAN_initializes_parameter);
CAN_Status CAN_Initializes(CAN_Module* CANx, CAN_InitType* CAN_initializes_parameter);

/** Filter Initialization functions **/
void CAN_Filter_Initializes_Enable(void);
void CAN_Filter_Initializes_Disable(void);
void CAN_Filter_Initializes(CAN_FilterInitType* CAN_filter_initializes_structure);

/** Configuration functions**/
void CAN_Structure_Initializes(CAN_InitType* CAN_initializes_parameter);
void CAN_Debug_Freeze_Enable(CAN_Module* CANx);
void CAN_Debug_Freeze_Disable(CAN_Module* CANx);
void CAN_Time_Stamp_Sent_Enable(CAN_Module* CANx);
void CAN_Time_Stamp_Sent_Disable(CAN_Module* CANx);

/** Transmit functions **/
uint8_t CAN_Transmit_Message_initializes(CAN_Module* CANx, CanTxMessage* transmit_message);
CAN_Tx_Status CAN_Transmit_Status_Get(CAN_Module* CANx, uint8_t mailbox_queue);
void CAN_Transmit_Message_Cancel(CAN_Module* CANx, uint8_t mailbox_queue);

/** Receive functions **/
void CAN_Message_Receive(CAN_Module* CANx, uint8_t FIFO_number, CanRxMessage* receive_message);
void CAN_FIFO_Release(CAN_Module* CANx, uint8_t FIFO_number);
uint8_t CAN_Message_Pending_Get(CAN_Module* CANx, uint8_t FIFO_number);

/** Operation modes functions **/
CAN_Status CAN_Operating_Mode_Select(CAN_Module* CANx, uint8_t CAN_operating_mode);
CAN_Status CAN_Sleep_Mode_Enter(CAN_Module* CANx);
CAN_Status CAN_Wake_Up_Enable(CAN_Module* CANx);

/** Error management functions **/
uint8_t CAN_Last_Error_Code_Get(CAN_Module* CANx);
uint8_t CAN_Receive_Error_Counter_Get(CAN_Module* CANx);
uint8_t CAN_LSB_Transmit_Error_Counter_Get(CAN_Module* CANx);

/** Interrupts and flags management functions **/
void CAN_Config_Interrupt_Enable(CAN_Module* CANx, uint32_t CAN_interrupt);
void CAN_Config_Interrupt_Disable(CAN_Module* CANx, uint32_t CAN_interrupt);
FlagStatus CAN_Flag_status_Get(CAN_Module* CANx, uint32_t CAN_flag);
void CAN_Flag_Status_Clear(CAN_Module* CANx, uint32_t CAN_flag);
INTStatus CAN_Interrupt_Status_Get(CAN_Module* CANx, uint32_t CAN_interrupt);
void CAN_Interrupt_Status_Clear(CAN_Module* CANx, uint32_t CAN_interrupt);



/************************************************************************************/
void CAN_Filter_Deactivation(uint32_t filter_position);
void CAN_Filter_Scale_16bit_Set(CAN_FilterInitType* CAN_filter_initializes_structure, \
                            uint32_t filter_position);
void CAN_Filter_Scale_32bit_Set(CAN_FilterInitType* CAN_filter_initializes_structure, \
                            uint32_t filter_position);
void CAN_Filter_Mode_Set(uint8_t filter_mode, uint32_t filter_position);
void CAN_Filter_DATA_FIFO_Assign(uint16_t filter_assign, uint32_t filter_position);
void CAN_Filter_Activate(uint32_t filter_position);

void CAN_Transmit_Message_ID_Config(CAN_Module* CANx, CanTxMessage* transmit_message, \
                                            uint8_t mailbox_queue);
void CAN_Transmit_Message_DLC_Config(CAN_Module* CANx, uint8_t data_length, \
                                            uint8_t mailbox_queue);
void CAN_Transmit_Message_Data_Config(CAN_Module* CANx, CanTxMessage* transmit_message, \
                                            uint8_t mailbox_queue);
void CAN_Transmit_Enable(CAN_Module* CANx, uint8_t mailbox_queue);


void CAN_Software_Reset(CAN_Module* CANx);
FlagStatus CAN_Transmit_Fail_Status_Get(CAN_Module* CANx,uint8_t mailbox_queue);
FlagStatus CAN_Arbitration_Lost_Status_Get(CAN_Module* CANx,uint8_t mailbox_queue);
FlagStatus CAN_Flag_Lowest_Priority_Get(CAN_Module* CANx,uint8_t mailbox_queue);
FlagStatus CAN_Flag_Transmit_Mailbox_Empty_Get(CAN_Module* CANx,uint8_t mailbox_queue);
FlagStatus CAN_Receive_Signal_Get(CAN_Module* CANx);
FlagStatus CAN_Last_Sample_Point_Get(CAN_Module* CANx);
FlagStatus CAN_Receive_Mode_Get(CAN_Module* CANx);
FlagStatus CAN_Transmit_Mode_Get(CAN_Module* CANx);
uint8_t CAN_Mailbox_Code_Get(CAN_Module* CANx);


#ifdef __cplusplus
}
#endif

#endif /* __N32G430_CAN_H__ */

